
//namespace ConsoleApp1
//{
//    //Class9.cs에서 배운 % 관련 연습 문제
//    //잔돈 교환
//    //아래의 예시를 활용해서 다음과 같은 프로그램을 설계하겠습니다.
    
//    //1. 사용자는 임의의 금액을 가지고 있습니다. 보유한 금액은 화면에 출력됩니다.
//    //2. 3종류의 코인에 대한 이름과 가격이 화면에 출력되어 있습니다.
//    //   코인의 이름은 각각 골드 블랙 레드 코인이며 가격은 10000, 5000, 1000원입니다.
//    //3. 사용자가 현재 보유하고 있는 골드, 블랙, 레드 코인의 개수가 화면에 출력됩니다.
//    //4. 사용자는 코인의 이름을 입력하여 구매할 코인을 선택합니다.
//    //5. 그 후 사용자는 구매할 코인의 개수만큼 코인을 구매할 수 있습니다.
//    //   MAX를 입력 시 최대치만큼 구입이 가능합니다.
//    //6. 구매 성공 시 남은 금액과 보유한 코인 개수가 출력됩니다.

//    internal class Class10
//    {
//        static void Main(string[] args)
//        {
//            //int money = 17500;
//            ////7500원을 남기고 싶습니다.
//            ////1) money에서 10000만큼 제거합니다.
//            //money -= 10000;
//            //Console.WriteLine(money);
//            //money = 17500;
//            ////2) money에서 %를 이용해 값을 남기겠습니다.
//            //money %= 10000;
//            //Console.WriteLine(money);
//            //money = 14500;
//            //int chun; //천
//            //int ochun;//오천
//            //int obak; //오백
//            ////money를 위에 있는 기준으로 거슬러주겠습니다.
//            //ochun = money / 5000;
//            //Console.WriteLine($"오천원 : {ochun}개");
//            //money %= 5000;
//            //Console.WriteLine($"현재 가지고 있는 금액 : {money}");
//        }
    
//    }
//}
